Revit 2027 API
Element.IsPhaseDemolishedValid Method
 Returns true if demolishedPhaseId is an allowed value for the property DemolishedPhaseId in this Element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsPhaseDemolishedValid(
	ElementId demolishedPhaseId
)
Public Function IsPhaseDemolishedValid (
	demolishedPhaseId As ElementId
) As Boolean
public:
bool IsPhaseDemolishedValid(
	ElementId^ demolishedPhaseId
)
member IsPhaseDemolishedValid :
        demolishedPhaseId : ElementId -> bool
Parameters
demolishedPhaseId ElementId
 The id of a Phase or invalidElementId.
Return Value
Boolean
 True if demolishedPhaseId is an allowed value for the property DemolishedPhaseId in this Element, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 Acts as a validator for setting the property DemolishedPhaseId.
See Also
Reference
Element Class
Autodesk.Revit.DB Namespace